title: 'public accessible RDP Services.'
status: experimental
description: 'rule detected any connections happen from public IPs to access RDP and allows the connection to a certain IP'
author: 'Michelle khalil'
logsource:
    product: "zeek"
    service: "rdp"
detection:
    approved_ip:
       dst_ip|startswith:
            - 192.168.219.55
    selection:
        Src_ip|startswith:
            - 192.168.
            - '10.'
            - '172.16'
            - '172.17'
            - '172.18'
            - '172.19'
            - '172.20'
            - '172.21'
            - '172.22'
            - '172.23'
            - '172.24'
            - '172.25'
            - '172.26'
            - '172.27'
            - '172.28'
            - '172.29'
            - '172.30'
            - '172.31'
            - '172.32'
    condition: 'not selection and not approved_ip'
fields: []
falsepositives: []
level: critical
