title: 'Harmful Desktopimgdownldr Execution'
status: experimental
description: 'Rule detected harmful desktopimgdownldr execution and downloading bad binaries'
author: 'Michelle Khalil'
logsource:
    category: 'process_creation'
    product: 'windows'
detection:
    selection:
        CommandLine|contains: 'desktopimgdownldr'
    filter:
        CommandLine|contains:
          - .jpg
          - .jpeg
          - .png
    condition: 'selection and not filter'
fields: []
falsepositives: []
level: critical