title: 'Malicious User Creation'
status: experimental
description: 'Rule detects malicious user creation unless it follows internal naming schemas.'
author: 'Michelle Khalil'
logsource:
    product: "aws"
detection:
    event_source:
        eventSource: "iam.amazonaws.com"
        eventName: "CreateUser"
    good_naming_schemas:
        UserName|startswith:
            - "SA_"
            - "TA_"
    source_creator:
        userIdentity.userName: "SA_UserMGT"
    condition: event_source and not (good_naming_schemas or source_creator)
fields: []
falsepositives: []
level: critical
